const PageRules: React.FC = () => {
    return <>
        <div className="bg-slate-800/50 backdrop-blur-sm rounded-2xl border border-slate-700 overflow-hidden p-6">
            <ol className="list-decimal list-inside space-y-4 text-slate-200">
                <li>Реєстрація учасників відбувається через Telegram бот.</li>
                <li>Кожен день обирається новий трек для змагань.</li>
                <li>Учасники мають 24 години, щоб подати свій найкращий час проходження треку.</li>
                <li>Результати оновлюються в реальному часі на веб-сайті.</li>
                <li>Переможець дня визначається за найкращим часом.</li>
                <li>У разі однакового часу, перевага надається учаснику, який подав результат раніше.</li>
                <li>Використання чітів або модифікацій гри заборонено.</li>
                <li>Адміністратори залишають за собою право дискваліфікувати учасників за порушення правил.</li>
                <li>Щотижня підбиваються підсумки та визначається переможець тижня.</li>
                <li>Учасники повинні використовувати ті ж ніки, що і в грі Velocidrone.</li>
            </ol>
        </div>
    </>
}

export default PageRules;